app/controllers/courses_controller.rb

  def show
    @course = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)

  def edit
    @course = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)

  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`name`, `created_at`, `updated_at`, `description`) VALUES('Kurssi', '2009-11-08 11:21:02', '2009-11-08 11:21:02', 'Kurssikuvaus')

  def update
    @course = Course.find(params[:id])

    respond_to do |format|
      if @course.update_attributes(params[:course])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
UPDATE `courses` SET `updated_at` = '2009-11-08 11:26:25', `name` = 'Kurssiz' WHERE `id` = 1